import type { Post } from "../types/post.ts";

export const MOCK_POSTS: Post[] = [
  {
    id: 1,
    title: "Python",
    content: "Python це потужна мова програмування, яка проста у вивченні. Він має ефективні структури даних високого рівня та простий, але ефективний підхід до об’єктно-орієнтованого програмування. Елегантний синтаксис і динамічна типізація Python разом з його інтерпретованим характером роблять його ідеальною мовою для створення сценаріїв і швидкої розробки додатків у багатьох сферах на більшості платформ.",
    author: "Dev",
    category: "Python"
  },
  {
    id: 2,
    title: "Java",
    content: "Java це об'єктно-орієнтована мова програмування та програмна платформа загального призначення, яка була розроблена компанією Sun Microsystems (тепер належить Oracle) у 1995 році. Java використовується для створення різноманітних додатків, включаючи веб-додатки, десктопні програми та мобільні додатки.",
    author: "Dev",
    category: "Java"
  },
  {
    id: 3,
    title: "JavaScript",
    content: "JavaScript це високорівнева, інтерпретована мова програмування, яка є однією з трьох основних технологій створення веб-сторінок поряд із HTML та CSS.",
    author: "Dev",
    category: "JavaScript"
  },
  {
    id: 4,
    title: "C++",
    content: "C++ це компільована, статично типізована універсальна мова програмування високого рівня з підтримкою кількох парадигм (процедурної, об'єктно-орієнтованої та узагальненої)",
    author: "Dev",
    category: "C++"
  },
  {
    id: 5,
    title: "C#",
    content: "C# це об’єктно-орієнтована, багатопарадигмальна мова програмування із суворою типізацією, розроблена компанією Microsoft у межах платформи .NET. ",
    author: "Dev",
    category: "C#"
  }
];
